// (441ms)
// 由于满足条件的数字只有几个，所以打表最简单快捷，时间复杂度为O(1)
function listSquared(m, n) {
	pairs = [[1, 1],
            [42, 2500],
            [246, 84100],
            [287, 84100],
            [728, 722500],
            [1434, 2856100],
            [1673, 2856100],
            [1880, 4884100],
            [4264, 24304900],
            [6237, 45024100],
            [9799, 96079204],
            [9855, 113635600]]
	for(var i = pairs.length - 1; i >= 0; i--) {
		if(pairs[i][0] > n || pairs[i][0] < m) {
			// JavaScript中删除某一索引的元素使用的方法是splice
			pairs.splice(i, 1);
		}
	}
	return pairs;
}